loumaro/stm32f411xe-drivers/3_uart_tx/Src/main.c
#include "stm32f411xe.h"

#define GPIOAEN     (1U<<0)
#define UART2EN     (1U<<17)

#define CR1_TE		(1U<<3)
#define CR1_UE		(1U<<13)

#define SYS_FREQ	16000000
#define APB1_CLK	SYS_FREQ

#define UART_BAUDRATE	11520


static void uart_set_baudrate(USART_TypeDef *USARTx,uint32_t periphClk,uint32_t baudRate);
static uint16_t compute_uart_baud(uint32_t periphClk,uint32_t baudRate);



int main(void){
    while(1){

    }
}

void uart2_tx_init(void){
	/**************** Configure uart gpio pin****************/
	/*Enable clock access to gpioa*/
	RCC->AHB1ENR |= GPIOAEN;
	/*Set PA2 to alternate function mode*/
	GPIOA->MODER |= (1U<<5);
	GPIOA->MODER &= ~(1U<<4);
	/*Set PA2 alternate function type to UART_TX (AF07)*/
	GPIOA->AFR[0] |= (111U<<8);
	GPIOA->AFR[0] |= (1U<<9);
	GPIOA->AFR[0] |= (1U<<10);
	GPIOA->AFR[0] &= ~(1U<<11);


	/**************** Configure uart module****************/
	/*Enable clock access to uart2*/
	RCC->APB1ENR |= UART2EN;
	/*Configure baudrate*/
	uart_set_baudrate(USART2,APB1_CLK,UART_BAUDRATE);
	/*Configure the transfer direction*/
	USART2->CR1 = CR1_TE;
	/*Enable UART module*/
	USART2->CR1 |= CR1_UE;

}

static void uart_set_baudrate(USART_TypeDef *USARTx,uint32_t periphClk,uint32_t baudRate){
	USARTx->BRR = compute_uart_bd(periphClk,baudRate);
}

static uint16_t compute_uart_baud(uint32_t periphClk,uint32_t baudRate){
	return ((periphClk+(baudRate/2U))/baudRate);
}
